<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"213b0ab7708405a52f35693148a8fb3812418da9edbe98da0691180f9996a49c","plan_job_ref":"Job Validations on PR #65 at https://github.com/SelfOverflow/discord-bots/actions/runs/22862869548","plan_out_hash":"1a664b095a441f034085e490be3872475db976dc379def89003c512a85e87099","plan_hash":"936fd928cbb3daf5cd1a9afacccc96dd96ed467ba2f273456be6d15a2ae92576","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
With variables: `image_tag = "11c8771ed620874ed470a50d2b0febfe0e7e9d6f"`
<details>
<summary>Plan: 7 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.execution_secrets_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "execution_secrets_policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "secretsmanager:GetSecretValue",
            ]
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
        }
    }

  # aws_autoscaling_group.ecs will be created
+   resource "aws_autoscaling_group" "ecs" {
+       arn                              = (known after apply)
+       availability_zones               = (known after apply)
+       default_cooldown                 = (known after apply)
+       desired_capacity                 = 1
+       force_delete                     = false
+       force_delete_warm_pool           = false
+       health_check_grace_period        = 300
+       health_check_type                = (known after apply)
+       id                               = (known after apply)
+       ignore_failed_scaling_activities = false
+       load_balancers                   = (known after apply)
+       max_size                         = 1
+       metrics_granularity              = "1Minute"
+       min_size                         = 1
+       name                             = (known after apply)
+       name_prefix                      = (known after apply)
+       predicted_capacity               = (known after apply)
+       protect_from_scale_in            = false
+       service_linked_role_arn          = (known after apply)
+       target_group_arns                = (known after apply)
+       vpc_zone_identifier              = [
+           "subnet-098c041204c05f1ab",
        ]
+       wait_for_capacity_timeout        = "10m"
+       warm_pool_size                   = (known after apply)

+       availability_zone_distribution (known after apply)

+       capacity_reservation_specification (known after apply)

+       launch_template {
+           id      = "lt-08d4f013a9a8481bc"
+           name    = (known after apply)
+           version = "$Latest"
        }

+       mixed_instances_policy (known after apply)

+       traffic_source (known after apply)
    }

  # aws_ecs_service.bot will be created
+   resource "aws_ecs_service" "bot" {
+       availability_zone_rebalancing      = "DISABLED"
+       cluster                            = "arn:aws:ecs:ap-south-1:613419461354:cluster/bablu-bot-cluster"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 50
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = (known after apply)
+       name                               = "bablu-bot-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags                               = {
+           "Environment" = "mono"
+           "ManagedBy"   = "terraform"
+           "Project"     = "bablu-bot"
        }
+       tags_all                           = {
+           "Environment" = "mono"
+           "ManagedBy"   = "terraform"
+           "Project"     = "bablu-bot"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false
    }

  # aws_ecs_task_definition.bot will be created
+   resource "aws_ecs_task_definition" "bot" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (known after apply)
+       enable_fault_injection   = (known after apply)
+       execution_role_arn       = "arn:aws:iam::613419461354:role/bablu-bot-ecs-execution-role"
+       family                   = "bablu-bot-task"
+       id                       = (known after apply)
+       network_mode             = "bridge"
+       requires_compatibilities = [
+           "EC2",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags                     = {
+           "Environment" = "mono"
+           "ManagedBy"   = "terraform"
+           "Project"     = "bablu-bot"
        }
+       tags_all                 = {
+           "Environment" = "mono"
+           "ManagedBy"   = "terraform"
+           "Project"     = "bablu-bot"
        }
+       task_role_arn            = "arn:aws:iam::613419461354:role/bablu-bot-ecs-task-role"
+       track_latest             = false
    }

  # aws_iam_policy.execution_secrets_policy will be created
+   resource "aws_iam_policy" "execution_secrets_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = "bablu-bot-execution-secrets-policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = (known after apply)
    }

  # aws_iam_role_policy_attachment.execution_secrets_attach will be created
+   resource "aws_iam_role_policy_attachment" "execution_secrets_attach" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "bablu-bot-ecs-execution-role"
    }

  # aws_launch_template.ecs will be updated in-place
!~  resource "aws_launch_template" "ecs" {
        id                                   = "lt-08d4f013a9a8481bc"
!~      image_id                             = "************************************************"
!~      instance_type                        = "t4g.micro" -> "t2.micro"
!~      latest_version                       = 1 -> (known after apply)
        name                                 = "ecs-bot20260309155247632900000006"
        tags                                 = {}
#        (15 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret.app_id will be created
+   resource "aws_secretsmanager_secret" "app_id" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "bablu-bot-bot-client-id"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 30
+       tags                           = {
+           "Environment" = "mono"
+           "ManagedBy"   = "terraform"
+           "Project"     = "bablu-bot"
        }
+       tags_all                       = {
+           "Environment" = "mono"
+           "ManagedBy"   = "terraform"
+           "Project"     = "bablu-bot"
        }

+       replica (known after apply)
    }

  # aws_secretsmanager_secret.discord_token will be created
+   resource "aws_secretsmanager_secret" "discord_token" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "bablu-bot-discord-app-token"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 30
+       tags                           = {
+           "Environment" = "mono"
+           "ManagedBy"   = "terraform"
+           "Project"     = "bablu-bot"
        }
+       tags_all                       = {
+           "Environment" = "mono"
+           "ManagedBy"   = "terraform"
+           "Project"     = "bablu-bot"
        }

+       replica (known after apply)
    }

Plan: 7 to add, 1 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Post merge deploy to production #40](https://github.com/SelfOverflow/discord-bots/actions/runs/22862943710)